yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/rp2040_uart0.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_uart0.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_UART0_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_UART0_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_UART0_UARTDR_OFFSET         0x000000  /* Data Register, UARTDR */
#define RP2040_UART0_UARTRSR_OFFSET        0x000004  /* Receive Status Register/Error Clear Register, UARTRSR/UARTECR */
#define RP2040_UART0_UARTFR_OFFSET         0x000018  /* Flag Register, UARTFR */
#define RP2040_UART0_UARTILPR_OFFSET       0x000020  /* IrDA Low-Power Counter Register, UARTILPR */
#define RP2040_UART0_UARTIBRD_OFFSET       0x000024  /* Integer Baud Rate Register, UARTIBRD */
#define RP2040_UART0_UARTFBRD_OFFSET       0x000028  /* Fractional Baud Rate Register, UARTFBRD */
#define RP2040_UART0_UARTLCR_H_OFFSET      0x00002c  /* Line Control Register, UARTLCR_H */
#define RP2040_UART0_UARTCR_OFFSET         0x000030  /* Control Register, UARTCR */
#define RP2040_UART0_UARTIFLS_OFFSET       0x000034  /* Interrupt FIFO Level Select Register, UARTIFLS */
#define RP2040_UART0_UARTIMSC_OFFSET       0x000038  /* Interrupt Mask Set/Clear Register, UARTIMSC */
#define RP2040_UART0_UARTRIS_OFFSET        0x00003c  /* Raw Interrupt Status Register, UARTRIS */
#define RP2040_UART0_UARTMIS_OFFSET        0x000040  /* Masked Interrupt Status Register, UARTMIS */
#define RP2040_UART0_UARTICR_OFFSET        0x000044  /* Interrupt Clear Register, UARTICR */
#define RP2040_UART0_UARTDMACR_OFFSET      0x000048  /* DMA Control Register, UARTDMACR */
#define RP2040_UART0_UARTPERIPHID0_OFFSET  0x000fe0  /* UARTPeriphID0 Register */
#define RP2040_UART0_UARTPERIPHID1_OFFSET  0x000fe4  /* UARTPeriphID1 Register */
#define RP2040_UART0_UARTPERIPHID2_OFFSET  0x000fe8  /* UARTPeriphID2 Register */
#define RP2040_UART0_UARTPERIPHID3_OFFSET  0x000fec  /* UARTPeriphID3 Register */
#define RP2040_UART0_UARTPCELLID0_OFFSET   0x000ff0  /* UARTPCellID0 Register */
#define RP2040_UART0_UARTPCELLID1_OFFSET   0x000ff4  /* UARTPCellID1 Register */
#define RP2040_UART0_UARTPCELLID2_OFFSET   0x000ff8  /* UARTPCellID2 Register */
#define RP2040_UART0_UARTPCELLID3_OFFSET   0x000ffc  /* UARTPCellID3 Register */

/* Register definitions *****************************************************/

#define RP2040_UART0_UARTDR         (RP2040_UART0_BASE + RP2040_UART0_UARTDR_OFFSET)
#define RP2040_UART0_UARTRSR        (RP2040_UART0_BASE + RP2040_UART0_UARTRSR_OFFSET)
#define RP2040_UART0_UARTFR         (RP2040_UART0_BASE + RP2040_UART0_UARTFR_OFFSET)
#define RP2040_UART0_UARTILPR       (RP2040_UART0_BASE + RP2040_UART0_UARTILPR_OFFSET)
#define RP2040_UART0_UARTIBRD       (RP2040_UART0_BASE + RP2040_UART0_UARTIBRD_OFFSET)
#define RP2040_UART0_UARTFBRD       (RP2040_UART0_BASE + RP2040_UART0_UARTFBRD_OFFSET)
#define RP2040_UART0_UARTLCR_H      (RP2040_UART0_BASE + RP2040_UART0_UARTLCR_H_OFFSET)
#define RP2040_UART0_UARTCR         (RP2040_UART0_BASE + RP2040_UART0_UARTCR_OFFSET)
#define RP2040_UART0_UARTIFLS       (RP2040_UART0_BASE + RP2040_UART0_UARTIFLS_OFFSET)
#define RP2040_UART0_UARTIMSC       (RP2040_UART0_BASE + RP2040_UART0_UARTIMSC_OFFSET)
#define RP2040_UART0_UARTRIS        (RP2040_UART0_BASE + RP2040_UART0_UARTRIS_OFFSET)
#define RP2040_UART0_UARTMIS        (RP2040_UART0_BASE + RP2040_UART0_UARTMIS_OFFSET)
#define RP2040_UART0_UARTICR        (RP2040_UART0_BASE + RP2040_UART0_UARTICR_OFFSET)
#define RP2040_UART0_UARTDMACR      (RP2040_UART0_BASE + RP2040_UART0_UARTDMACR_OFFSET)
#define RP2040_UART0_UARTPERIPHID0  (RP2040_UART0_BASE + RP2040_UART0_UARTPERIPHID0_OFFSET)
#define RP2040_UART0_UARTPERIPHID1  (RP2040_UART0_BASE + RP2040_UART0_UARTPERIPHID1_OFFSET)
#define RP2040_UART0_UARTPERIPHID2  (RP2040_UART0_BASE + RP2040_UART0_UARTPERIPHID2_OFFSET)
#define RP2040_UART0_UARTPERIPHID3  (RP2040_UART0_BASE + RP2040_UART0_UARTPERIPHID3_OFFSET)
#define RP2040_UART0_UARTPCELLID0   (RP2040_UART0_BASE + RP2040_UART0_UARTPCELLID0_OFFSET)
#define RP2040_UART0_UARTPCELLID1   (RP2040_UART0_BASE + RP2040_UART0_UARTPCELLID1_OFFSET)
#define RP2040_UART0_UARTPCELLID2   (RP2040_UART0_BASE + RP2040_UART0_UARTPCELLID2_OFFSET)
#define RP2040_UART0_UARTPCELLID3   (RP2040_UART0_BASE + RP2040_UART0_UARTPCELLID3_OFFSET)


/* Register bit definitions *************************************************/


#define RP2040_UART0_UARTDR_OE                         (1 << 11)  /* Overrun error. This bit is set to 1 if data is received and the receive FIFO is already full. This is cleared to 0 once there is an empty space in the FIFO and a new character can be written to it. */
#define RP2040_UART0_UARTDR_BE                         (1 << 10)  /* Break error. This bit is set to 1 if a break condition was detected, indicating that the received data input was held LOW for longer than a full-word transmission time (defined as start, data, parity and stop bits). In FIFO mode, this error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state), and the next valid start bit is received. */
#define RP2040_UART0_UARTDR_PE                         (1 << 9)  /* Parity error. When set to 1, it indicates that the parity of the received data character does not match the parity that the EPS and SPS bits in the Line Control Register, UARTLCR_H. In FIFO mode, this error is associated with the character at the top of the FIFO. */
#define RP2040_UART0_UARTDR_FE                         (1 << 8)  /* Framing error. When set to 1, it indicates that the received character did not have a valid stop bit (a valid stop bit is 1). In FIFO mode, this error is associated with the character at the top of the FIFO. */
#define RP2040_UART0_UARTDR_DATA_MASK                  (0xff)  /* Receive (read) data character. Transmit (write) data character. */

#define RP2040_UART0_UARTRSR_OE                        (1 << 3)  /* Overrun error. This bit is set to 1 if data is received and the FIFO is already full. This bit is cleared to 0 by a write to UARTECR. The FIFO contents remain valid because no more data is written when the FIFO is full, only the contents of the shift register are overwritten. The CPU must now read the data, to empty the FIFO. */
#define RP2040_UART0_UARTRSR_BE                        (1 << 2)  /* Break error. This bit is set to 1 if a break condition was detected, indicating that the received data input was held LOW for longer than a full-word transmission time (defined as start, data, parity, and stop bits). This bit is cleared to 0 after a write to UARTECR. In FIFO mode, this error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received. */
#define RP2040_UART0_UARTRSR_PE                        (1 << 1)  /* Parity error. When set to 1, it indicates that the parity of the received data character does not match the parity that the EPS and SPS bits in the Line Control Register, UARTLCR_H. This bit is cleared to 0 by a write to UARTECR. In FIFO mode, this error is associated with the character at the top of the FIFO. */
#define RP2040_UART0_UARTRSR_FE                        (1 << 0)  /* Framing error. When set to 1, it indicates that the received character did not have a valid stop bit (a valid stop bit is 1). This bit is cleared to 0 by a write to UARTECR. In FIFO mode, this error is associated with the character at the top of the FIFO. */

#define RP2040_UART0_UARTFR_RI                         (1 << 8)  /* Ring indicator. This bit is the complement of the UART ring indicator, nUARTRI, modem status input. That is, the bit is 1 when nUARTRI is LOW. */
#define RP2040_UART0_UARTFR_TXFE                       (1 << 7)  /* Transmit FIFO empty. The meaning of this bit depends on the state of the FEN bit in the Line Control Register, UARTLCR_H. If the FIFO is disabled, this bit is set when the transmit holding register is empty. If the FIFO is enabled, the TXFE bit is set when the transmit FIFO is empty. This bit does not indicate if there is data in the transmit shift register. */
#define RP2040_UART0_UARTFR_RXFF                       (1 << 6)  /* Receive FIFO full. The meaning of this bit depends on the state of the FEN bit in the UARTLCR_H Register. If the FIFO is disabled, this bit is set when the receive holding register is full. If the FIFO is enabled, the RXFF bit is set when the receive FIFO is full. */
#define RP2040_UART0_UARTFR_TXFF                       (1 << 5)  /* Transmit FIFO full. The meaning of this bit depends on the state of the FEN bit in the UARTLCR_H Register. If the FIFO is disabled, this bit is set when the transmit holding register is full. If the FIFO is enabled, the TXFF bit is set when the transmit FIFO is full. */
#define RP2040_UART0_UARTFR_RXFE                       (1 << 4)  /* Receive FIFO empty. The meaning of this bit depends on the state of the FEN bit in the UARTLCR_H Register. If the FIFO is disabled, this bit is set when the receive holding register is empty. If the FIFO is enabled, the RXFE bit is set when the receive FIFO is empty. */
#define RP2040_UART0_UARTFR_BUSY                       (1 << 3)  /* UART busy. If this bit is set to 1, the UART is busy transmitting data. This bit remains set until the complete byte, including all the stop bits, has been sent from the shift register. This bit is set as soon as the transmit FIFO becomes non-empty, regardless of whether the UART is enabled or not. */
#define RP2040_UART0_UARTFR_DCD                        (1 << 2)  /* Data carrier detect. This bit is the complement of the UART data carrier detect, nUARTDCD, modem status input. That is, the bit is 1 when nUARTDCD is LOW. */
#define RP2040_UART0_UARTFR_DSR                        (1 << 1)  /* Data set ready. This bit is the complement of the UART data set ready, nUARTDSR, modem status input. That is, the bit is 1 when nUARTDSR is LOW. */
#define RP2040_UART0_UARTFR_CTS                        (1 << 0)  /* Clear to send. This bit is the complement of the UART clear to send, nUARTCTS, modem status input. That is, the bit is 1 when nUARTCTS is LOW. */

